In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "HeroesOfPymoli/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [3]:
# Player Count
players_df = pd.DataFrame(columns = ["Total Players"])
players_df["Total Players"] = [purchase_data["SN"].nunique()]
players_df

   Total Players
0            576

In [4]:
### Purchasing Analysis (Total)
purchasing_df = pd.DataFrame()

# Number of Unique Items
unique_items = purchase_data["Item ID"].nunique()

purchasing_df["Number of Unique Items"] = [unique_items]

# Avg price
avg_price = purchase_data["Price"].mean()

purchasing_df["Average Price"] = [avg_price]

# Number of Purchases
total_purchases = purchase_data["Purchase ID"].count()

purchasing_df["Number of Purchases"] = [total_purchases]

# total revenue
total_revenue = purchase_data["Price"].sum()

purchasing_df["Total Revenue"] = [total_revenue]


purchasing_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [11]:
### Gender Demogrpahics
gender_df = pd.DataFrame()

# removing duplicate SN's 
noduplicates_df = purchase_data.drop_duplicates(subset = ["SN"])

# getting gender counts
gender_values = noduplicates_df["Gender"].value_counts().tolist()

# creating columns
gender_df["Total Count"] = [gender_values [0]]

gender_df

   Total Count
0          484

In [57]:
result = pd.DataFrame({"Gender":["Male", "Female","Other / Non-Disclosed"], "Total Count": gender_values})
result

player_total = sum(gender_values)

In [58]:
result["Percentage of Players"] = round((result["Total Count"] / player_total)*100,2)
result

                  Gender  Total Count  Percentage of Players
0                   Male          484                  84.03
1                 Female           81                  14.06
2  Other / Non-Disclosed           11                   1.91

In [59]:
result = result.set_index("Gender")

In [60]:
result

                       Total Count  Percentage of Players
Gender
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [61]:
### Purchasing Analysis (GENDER)

noduplicates_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [62]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [63]:
##  - Grouping 
import numpy as np
purchase_data.groupby(['Gender'])['Price'].agg(np.mean)

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [64]:
#noduplicates_df.groupby('Gender').count()
# noduplicates_df.groupby(['Gender'])['Purchase ID'].agg(np.sum)
purchase_data['Gender'].value_counts()

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [65]:
pd_df = purchase_data.groupby(['Gender']).agg({'Price':['count','mean','sum']})
pd_df

                      Price
                      count      mean      sum
Gender
Female                  113  3.203009   361.94
Male                    652  3.017853  1967.64
Other / Non-Disclosed    15  3.346000    50.19

In [66]:
pd_df = pd_df.droplevel(0, axis=1)
pd_df

                       count      mean      sum
Gender
Female                   113  3.203009   361.94
Male                     652  3.017853  1967.64
Other / Non-Disclosed     15  3.346000    50.19

In [67]:
pd_df.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value']
pd_df

,Purchase Count,Average Purchase Price,Total Purchase Value
Gender,,,
Female,113,3.203009,361.94
Male,652,3.017853,1967.64
Other / Non-Disclosed,15,3.346000,50.19

In [68]:
purchase_data.shape

(780, 7)

In [69]:
result

                       Total Count  Percentage of Players
Gender
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [70]:
df_merge = pd.merge(pd_df, result, left_index=True, right_index=True)
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Total Count,Percentage of Players
Gender,,,,,
Female,113,3.203009,361.94,81,14.06
Male,652,3.017853,1967.64,484,84.03
Other / Non-Disclosed,15,3.346000,50.19,11,1.91

In [86]:
# df_merge['Average Total Purchase per Person'] = df_merge['Total Purchase Value']/df_merge['Total Count']
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total per persion
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [87]:
# del df_merge['Percentage of Players']
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total per persion
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [88]:
df_merge.columns = ['Purchase Count', 'Average Purchase Price', 'Total Purchase Value', "Average Total Purchase per Person"]
df_merge

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727